src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Files/Ext/ObjectModule.bsl
Var SignedObjectRecord Export;


// Handler of event BeforeWrite
//
Procedure BeforeWrite(Cancellation)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not ValueIsFilled(FileOwner) Then
		Raise NStr("en = 'It is impossible to record file with empty field Owner.'");
	EndIf;
	
	If NOT PrivilegedMode() And SignedObjectRecord <> True Then
		
		If ValueIsFilled(Ref) Then
			
			RefSigned = CommonUse.GetAttributeValue(Ref, "Signed");
			If Signed And RefSigned Then
				Raise NStr("en = 'Signed file cannot be edited.'");
			EndIf;	
			
			RefEncrypted = CommonUse.GetAttributeValue(Ref, "Encrypted");
			If Encrypted And RefEncrypted And Signed And NOT RefSigned Then
				Raise NStr("en = 'Encrypted file cannot be signed.'");
			EndIf;	
			
		EndIf;	
		
	EndIf;	
	
	If Not IsNew() Then
		
		If Not CurrentVersion.IsEmpty() Then
			
			// Change picture index, propably, version has appeared or version picture index has been modified
			CurrentVersionAttributes = CommonUse.GetAttributeValues(CurrentVersion, 
				"PictureIndex, Size, CreationDate, Author, Extension, VersionNo, Volume, FilePath, Code, FileName");
			
			PictureIndex = CurrentVersionAttributes.PictureIndex;
			
			// copy attributes to impove RLS operation
			CurrentVersionSize 			= CurrentVersionAttributes.Size;
			CurrentVersionDateCreated 	= CurrentVersionAttributes.CreationDate;
			CurrentVersionAuthor 		= CurrentVersionAttributes.Author;
			CurrentVersionExtension 	= CurrentVersionAttributes.Extension;
			CurrentVersionVersionNumber = CurrentVersionAttributes.VersionNo;
			CurrentVersionVolume 		= CurrentVersionAttributes.Volume;
			CurrentVersionFilePath 	= CurrentVersionAttributes.FilePath;
			CurrentVersionCode 			= CurrentVersionAttributes.Code;
			
			// Check equity of the file name and file current version
			// If names differ - version name should become equal to the file dossier name
			If CurrentVersionAttributes.FileName <> FileName Then
				Object = CurrentVersion.GetObject();
				LockDataForEdit(Object.Ref);
				If Object <> Undefined Then
					SetPrivilegedMode(True);
					Object.FileName = FileName;
					Object.Write();
					SetPrivilegedMode(False);
				EndIf;	
			EndIf;
		Else
			PictureIndex = FileOperationsClientServer.GetFilePictogramIndex(Undefined);
		EndIf;
		
		If DeletionMark And Not DeletionMarkInIB() Then
			
			// Check right "Mark for deletion".
			If NOT FileOperationsOverrided.DeletionMarkSettingPermitted(FileOwner) Then
				Raise StringFunctionsClientServer.SubstitureParametersInString(
				                     NStr("en = 'You do not have the right ""Mark for deletion"" of the file ""%1"".'"),
				                     String(Ref));
			EndIf;
			
			// Try to mark for deletion
			If Not LockedBy.IsEmpty() Then
				Raise StringFunctionsClientServer.SubstitureParametersInString(
				                    NStr("en = 'The file ""%1"" cannot be deleted as it is being edited by user ""%2"".'"),
				                    FileName,
				                    String(LockedBy) );
			EndIf;
			
		EndIf;
		
		VIBDescription = VIBDescription();
		If FileName <> VIBDescription Then 
			If Not LockedBy.IsEmpty() Then
				Raise StringFunctionsClientServer.SubstitureParametersInString(
				                    NStr("en = 'The file ""%1"" cannot be renamed as it is being edited by user ""%2"".'"),
				                    VIBDescription,
				                    String(LockedBy) );
			EndIf;
		EndIf;
		
	EndIf;
	
	
	Description = TrimAll(FileName);
EndProcedure

// Returns current deletion mark value in the infobase
Function DeletionMarkInIB()
	Query = New Query;
	Query.Text = 
		"SELECT
		|	Files.DeletionMark
		|FROM
		|	Catalog.Files AS Files
		|WHERE
		|	Files.Ref = &Ref";

	Query.SetParameter("Ref", Ref);

	Result = Query.Execute();

	If Not Result.IsEmpty() Then
		Selection = Result.Choose();
		Selection.Next();
		Return Selection.DeletionMark;
	EndIf;	
	
	Return Undefined;
EndFunction

// Returns description current value in the infobase
Function VIBDescription()
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	Files.FileName
	|FROM
	|	Catalog.Files AS Files
	|WHERE
	|	Files.Ref = &Ref";
	
	Query.SetParameter("Ref", Ref);
	Result = Query.Execute();
	
	If Not Result.IsEmpty() Then
		Selection = Result.Choose();
		Selection.Next();
		Return Selection.FileName;
	EndIf;
	
	Return Undefined;	
	
EndFunction

Procedure Filling(FillingData, StandardProcessing)
	If IsNew() Then
		CreationDate 	= CurrentDate();
		StoreVersions 	= True;
		PictureIndex 	= FileOperationsClientServer.GetFilePictogramIndex(Undefined);
		
		Author 			= CommonUse.CurrentUser();
		CreationDate 	= CurrentDate();
	EndIf;
EndProcedure
